console.log("самооценка:");
console.log("вёрстка валидная +10");
console.log(`вёрстка семантическая:
В коде страницы присутствуют семантические теги HTML5: article, footer, header, main, nav, section, figure используются заголовки h1-h3 +20
`);
console.log("для оформления СV используются css-стили +10");
console.log("контент размещается в блоке, который горизонтально центрируется на странице. Фоновый цвет, тянется во всю ширину страницы +10")
console.log("вёрстка адаптивная: ни на одном из разрешений экрана до 320px включительно не появляется горизонтальная полоса прокрутки, при этом всё содержание страницы сохраняется +10");
console.log("есть меню. Ссылки в пунктах меню ведут на основные разделы CV. При кликах по пунктам меню реализована плавная прокрутка по якорям. При уменьшении ширины экрана меню становится адаптивным. +10")
console.log("присутствует фото автора CV, пропорции изображения не искажены, у изображения есть атрибут alt +10");
console.log("контакты для связи и перечень навыков оформлены в виде списка ul > li +10");
console.log("CV содержит контакты для связи, краткую информацию о себе, перечень навыков, информацию об образовании и уровне английского +10");
console.log("CV содержит пример с подсветкой кода +10");
console.log("CV содержит изображения-ссылки на выполненные проекты. При клике по изображению страница проекта открывается в новой вкладке +10");
console.log("CV выполнено на английском языке +10");
console.log("выполнены требования к Pull Request: есть ссылка на задание, скриншот страницы СV, ссылка на деплой страницы CV на GitHub Pages, выполнена самооценка +10");
console.log("видеорезюме автора CV на английском языке +0");
console.log("качество выполнения CV не ниже чем в примерах CV, приведённых в материалах к заданию +10");
console.log("итого: 150");
